Revit 2026 API

# RailConnectionOption Enumeration

---

The connections between rails.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RailConnectionOption
```
```vb
Public Enumeration RailConnectionOption
```
```cpp
public enum class RailConnectionOption
```
```fsharp
type RailConnectionOption
```

| Member name | Value | Description |
| --- | --- | --- |
| Trim | 0 | Rails will be trimmed and cut with a vertical plane. |
| Weld | 1 | Rails will be joined in a manner as close to a miter as possible. |

#### Reference

Autodesk.Revit.DB.Architecture Namespace